app/Controllers/Categorias.php

SELECT *
FROM `categoria`
---
    public function index()
    {
        //chamar uma view que exibe todas as categorias.
        $categoriaModel = new \App\Models\CategoriaModel;

        $data = [
            'categorias' => $categoriaModel->find(),
            'titulo'     => 'Listando todas as categorias'
        ];

INSERT INTO `categoria` (`nomecategoria`) VALUES ('Acessórios')
---
    public function inserir()
    {

        $data = [
            'titulo' => 'Inserir nova Categoria',
            'acao'   => 'Inserir',
            'msg'    => '',
        ];

        if ($this->request->getMethod() === 'post') {
            $categoriaModel = new \App\Models\CategoriaModel;
            $categoriaModel->set('nomecategoria', $this->request->getPost('nomecategoria'));

            if ($categoriaModel->insert()) {

SELECT *
FROM `categoria`
WHERE `categoria`.`id` = '4'
UPDATE `categoria` SET `nomecategoria` = 'Acessórios Games'
WHERE `categoria`.`id` IN ('4')
---
    public function editar($id)
    {
        $data = [
            'titulo' => 'Editar Categoria ' . $id,
            'acao'   => 'Editar',
            'msg'    => '',
        ];

        $categoriaModel = new \App\Models\CategoriaModel;
        $categoria = $categoriaModel->find($id);

        if($this->request->getMethod() === 'post') {
            $categoria->nomecategoria = $this->request->getPost('nomecategoria');

            if($categoriaModel->update($id, $categoria)) {